{
  "company": "Globant",
  "ticker": "GLOB",
  "year": 2015,
  "search_query": "Globant competitors 2015 IT services digital transformation",
  "search_date": "2025-12-24",
  "context": "In 2015, Globant was expanding rapidly through acquisitions including Clarice Technologies, grupoAssa (Argentina), Xappia, Giant Monkey Robot (GMR), and BlueCap (Spain). The company was strengthening its presence in Asia and Latin America. As a relatively newer player in digital transformation and IT services, Globant competed against established global consulting firms and specialized IT services providers.",
  "competitors": [
    {
      "name": "Accenture",
      "notes": "Founded in 1989, headquartered in Dublin, Ireland. Professional services company with 800,000+ employees across 120+ countries offering strategy, consulting, operations, digital transformation, cloud computing, and cybersecurity. Generates 2,788% the revenue of Globant."
    },
    {
      "name": "Thoughtworks",
      "notes": "Founded in 1993, based in Chicago, Illinois. Technology consultancy specializing in custom software development and technology innovation, with services in digital transformation, data and AI integration, adaptable technology platforms, and digital product design."
    },
    {
      "name": "EPAM Systems",
      "notes": "Founded in 1993, based in Newtown, Pennsylvania. Public company providing digital engineering, cloud transformation, and AI-enabled services across various industries. One of Globant's top competitors in the IT Services industry."
    },
    {
      "name": "GlobalLogic",
      "notes": "Digital product engineering company providing services including product strategy, user experience design, and digital business transformation."
    },
    {
      "name": "Virtusa",
      "notes": "Founded in 1996, based in Southborough, Massachusetts. Provides digital engineering and technology services, offering problem-solving and execution of technology ideas to address business challenges."
    },
    {
      "name": "SoftServe",
      "notes": "IT services and consulting company competing in digital transformation space."
    },
    {
      "name": "Perficient",
      "notes": "Digital consultancy providing technology consulting and solutions."
    },
    {
      "name": "Wipro",
      "notes": "Global IT services and consulting company."
    },
    {
      "name": "Infosys",
      "notes": "Global leader in consulting, technology, and outsourcing services."
    },
    {
      "name": "Cognizant",
      "notes": "Major player in digital transformation offering IT consulting, technology services, and digital solutions."
    },
    {
      "name": "Endava",
      "notes": "IT services company focusing on digital transformation."
    }
  ],
  "sources": [
    "https://www.cbinsights.com/company/globant/alternatives-competitors",
    "https://www.terminal.io/blog/5-globant-competitors-for-software-development-in-2025",
    "https://craft.co/globant/competitors",
    "https://tracxn.com/d/companies/globant/__B6xmvfiWqR2RLbaDXPgNg-XiT-nYJtXqQVZrRYaONTY",
    "https://foundersarm.com/blog/globant-competitors",
    "https://www.cbinsights.com/company/globant",
    "https://en.wikipedia.org/wiki/Globant",
    "https://www.owler.com/company/globant/competitors"
  ]
}
