{
  "company": "Globant",
  "ticker": "GLOB",
  "year": 2020,
  "search_query": "Globant competitors 2020 digital transformation services",
  "search_date": "2025-12-24",
  "context": "In January 2020, Globant acquired BiLive (Argentina), continuing its acquisition strategy. The company operated as a digitally native provider offering services in engineering, innovation, design, and artificial intelligence across various sectors including automotive, media & entertainment, healthcare, finance, airlines, hospitality, gaming, edtech, sports, and retail. Services included software development, AI integration, enterprise software customization, and cloud computing.",
  "competitors": [
    {
      "name": "Accenture",
      "notes": "Top competitor. Professional services company headquartered in Dublin, Ireland with 800,000+ employees across 120+ countries. Offers comprehensive services in digital transformation, cloud computing, cybersecurity, strategy, consulting, and operations."
    },
    {
      "name": "Thoughtworks",
      "notes": "Technology consultancy specializing in custom software development and technology innovation. Founded in 1993, based in Chicago, Illinois. Offers digital transformation services including data and AI integration, adaptable technology platforms, and digital product design."
    },
    {
      "name": "EPAM Systems",
      "notes": "One of Globant's top competitors. Public company founded in Newtown, Pennsylvania in 1993. Works within the IT Services industry with 28,198 more employees than Globant. Provides digital engineering and AI-enabled services."
    },
    {
      "name": "SoftServe",
      "notes": "IT services and digital transformation company."
    },
    {
      "name": "Perficient",
      "notes": "Digital consultancy and technology services provider."
    },
    {
      "name": "GlobalLogic",
      "notes": "Digital product engineering and business transformation services company."
    },
    {
      "name": "Wipro",
      "notes": "Global IT services and consulting firm."
    },
    {
      "name": "Infosys",
      "notes": "Top competitor. Global leader in consulting, technology, and outsourcing services."
    },
    {
      "name": "Cognizant",
      "notes": "IT consulting, technology services, and digital solutions provider."
    },
    {
      "name": "Endava",
      "notes": "IT services company focused on digital transformation."
    },
    {
      "name": "Virtusa",
      "notes": "Founded in 1996, based in Southborough, Massachusetts. Provides digital engineering and technology services for business challenges."
    },
    {
      "name": "UST",
      "notes": "Listed as one of Globant's top competitors in digital services."
    },
    {
      "name": "Happiest Minds",
      "notes": "Digital transformation and IT services competitor."
    }
  ],
  "sources": [
    "https://tracxn.com/d/companies/globant/__B6xmvfiWqR2RLbaDXPgNg-XiT-nYJtXqQVZrRYaONTY",
    "https://www.terminal.io/blog/5-globant-competitors-for-software-development-in-2025",
    "https://www.cbinsights.com/company/globant",
    "https://www.cbinsights.com/company/globant/alternatives-competitors",
    "https://en.wikipedia.org/wiki/Globant",
    "https://craft.co/globant/competitors",
    "https://foundersarm.com/blog/globant-competitors",
    "https://www.owler.com/company/globant/competitors"
  ]
}
