{
  "company": "Pegasystems",
  "ticker": "PEGA",
  "year": 2010,
  "search_query": "Pegasystems competitors 2010",
  "search_date": "2025-12-24",
  "context": "By 2010, the BPM market had matured with clear leaders emerging. According to Forrester's August 2010 Wave evaluation, Pegasystems and Appian led with the best combination of modeling, design, and development features. Major acquisitions occurred: IBM acquired Lombardi in December 2009, and Progress acquired Savvion in January 2010. The top 3 BPM vendors (Pega, IBM, Oracle) were all US-based, with IBM being the global market leader. North America accounted for over half of the global BPM market revenue.",
  "competitors": [
    {
      "name": "IBM (WebSphere, Lombardi)",
      "notes": "Forrester Wave Leader in 2010. IBM had been a main BPM provider for over two decades. Acquired Lombardi in December 2009 to combine simplified business-oriented environment with WebSphere Process Server's robust integration platform. Multiple products across WebSphere, Lotus, Tivoli, FileNet and Rational divisions."
    },
    {
      "name": "Appian",
      "notes": "Forrester Wave Leader in 2010 alongside Pegasystems. BPM specialist with 120 customers and 160 employees. Strong in design, development, monitoring and optimization. Focused on government and commercial sectors including retail, manufacturing, financial services, healthcare, and energy."
    },
    {
      "name": "Software AG",
      "notes": "Forrester Wave Leader in 2010 with competitive product offering industry-leading capabilities."
    },
    {
      "name": "Savvion",
      "notes": "Forrester Wave Leader in 2010. Acquired by Progress Software in January 2010."
    },
    {
      "name": "Oracle",
      "notes": "Forrester Strong Performer in 2010. Top 3 BPM vendor globally. Completed acquisition of BEA Systems to broaden BPM portfolio and strengthen integration capabilities."
    },
    {
      "name": "Global 360",
      "notes": "Forrester Strong Performer in 2010 with compelling BPM product."
    },
    {
      "name": "HandySoft (BizFlow)",
      "notes": "Forrester Strong Performer in 2010. Provider of people-intensive process solutions."
    },
    {
      "name": "Fujitsu",
      "notes": "Forrester Strong Performer in 2010 with competitive BPM offering."
    },
    {
      "name": "TIBCO",
      "notes": "BPM+ approach showcasing breadth and depth of functionality. Very strong in highly dynamic processes, goal-based process analytics and process execution."
    },
    {
      "name": "Metastorm",
      "notes": "Continued presence in BPM market with workflow and process management solutions."
    },
    {
      "name": "Lombardi",
      "notes": "Acquired by IBM in December 2009, bringing simplified business-oriented BPM environment."
    },
    {
      "name": "Bizagi",
      "notes": "Emerging BPM vendor gaining traction in the market."
    },
    {
      "name": "K2",
      "notes": "Workflow and BPM platform provider competing in the mid-market."
    }
  ],
  "sources": [
    "https://www.idevnews.com/images/emailers/110415_ProgressWhitePaper_EU_Kathy/2010-forrester-wave-bpm.pdf",
    "https://camthecisstudent.wordpress.com/2010/01/28/which-bpm-suite-solution-is-right-for-you/",
    "https://www.mordorintelligence.com/industry-reports/business-process-management-market"
  ]
}
